app/controllers/competencies_controller.rb

  def index
    competencies = Cbe::Competency.all
---
SELECT `cbe_competencies`.* FROM `cbe_competencies`