app/controllers/programs_controller.rb

SELECT `cbe_programs`.* FROM `cbe_programs`
---
  def index
    programs = Cbe::Program.all