app/controllers/record_of_performance_controller.rb

SELECT  `admin_users`.* FROM `admin_users`  WHERE `admin_users`.`id` = 7 LIMIT 1
SELECT  `cbe_users`.* FROM `cbe_users`  WHERE `cbe_users`.`familyName` = 'Arne' AND `cbe_users`.`givenName` = 'Tom'  ORDER BY `cbe_users`.`id` ASC LIMIT 1
SELECT  `cbe_organizations`.* FROM `cbe_organizations`   ORDER BY `cbe_organizations`.`id` ASC LIMIT 1
---
  def post_service
    user_id = nil
    params.each do |key,value|
      if /[[:alpha:]]+, [[:alpha:]]+/.match key
        user_id = value.to_i
        break
      end
    end
    admin_user = AdminUser.find(user_id)

    cbe_user = Cbe::User.where(familyName: admin_user.last_name, givenName: admin_user.first_name).first
    if cbe_user.present?
      base_uri = Rails.application.config.tool_consumer_registry.registry['tc_deployment_url']
      organization = Cbe::Organization.first