app/controllers/users_controller.rb

  def index
    users = Cbe::User.all
---
SELECT `cbe_users`.* FROM `cbe_users`

  def show
    user = Cbe::User.find(params[:id])
---
SELECT  `cbe_users`.* FROM `cbe_users`  WHERE `cbe_users`.`id` = 13 LIMIT 1